import java.util.Date;

public class Main {
    public static void main(String[] args) {
        Reader[] readers = new Reader[5];
        readers[0] = new Reader("Петров В. В.", 111111, "Экология и природопользование", "2000.01.01", "+79001231212");
        readers[1] = new Reader("Иванов Г. Н.", 111112, "Библиотечное дело", "2000.02.15", "+79005675656");
        readers[2] = new Reader("Сидоров А. А.", 111113, "Изобразительное искусство", "1998.06.12", "+79008908989");
        readers[3] = new Reader("Александров Ю. А.", 111114, "Информационные системы и программирование", "2002.09.09", "+79001234567");
        readers[4] = new Reader("Горный А. Г.", 111115, "Менеджмент", "2000.03.01", "+79009876543");

        readers[0].takeBook(6);
        readers[0].takeBook("Волшебник изумрудного города", "А. П. Чехов: Сборник произведений");
        readers[0].takeBook(3);
        readers[0].takeBook("Волшебник изумрудного города");
    }
}